Revit 2024 API
DistributionSysTypeSetIterator Class
An iterator to a DistributionSys type set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class DistributionSysTypeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class DistributionSysTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class DistributionSysTypeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
See Also
DistributionSysTypeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace